import React, { useContext, useEffect } from 'react'
import { useNavigate } from 'react-router-dom'
import { Context } from '../Context';

export default function Policy() {

    const navigate = useNavigate();
    const { user, setUser } = useContext(Context);

    useEffect(() => {
        const interval = setInterval(() => {
            setUser({ ...user, policyTime: user.policyTime + 1 })
        }, 1000);

        return () => clearInterval(interval);
    }, [user])

    return (
        <div className='container py-5 text-center' dir='rtl'>
            <div className="title">
                <h2>تواصل</h2>
                <h2>تواصل</h2>
            </div>
            <div className='row justify-content-center text-end'>
                <div className='col-md-6'>
                    <div className='card shadow-sm'>
                        <div className='card-header'>
                            <h4>سياسة الخصوصية</h4>
                        </div>
                        <div className='card-body'>
                            <h6 className='text-start'>تاريخ السريان: 26 نوفمبر 2022م </h6>
                            <h5 className='mb-4 mt-5'>سبب مشاركتنا لسياسة الخصوصية هذه معك</h5>
                            <p>
                                <span>حماية خصوصية معلوماتك المالية أهم ما يشغلنا </span>
                                تريد شركة تواصل (يُشار إليها باسم "تواصل") أن تتحلى بالانفتاح والشفافية فيما يتعلق بكيفية جمع معلوماتك الشخصية والنحو المحدود الذي تُستخدم فيه.<br />
                                نحن ملتزمون بالحفاظ على سرية بياناتك المالية غير العامة. وتتضمن هذه المعلومات معلومات بطاقة الائتمان الخاصة بك أو معلومات طرق الدفع الأخرى. من الآن فصاعدًا، سوف نشير إلى تلك المعلومات اختصارًا باسم "المعلومات الشخصية".
                                قد نحتاج إلى مشاركة "معلوماتك الشخصية" في ظل ظروف معينة: بحيث يمكننا إمدادك بأفضل خدمة ممكنة، أو تشغيل شركتنا، أو الامتثال للطلبات القانونية. سوف نتناول هذه الظروف بمزيد من التفصيل في موضع لاحق بهذا المستند.<br />
                                <span>*يرجى قراءة سياسة الخصوصية هذه. ستساعدك سياسة الخصوصية على معرفة ما نشاركه من معلومات، وما لا نشاركه، بالإضافة إلى كيفية الحفاظ على سلامة معلوماتك.</span><br />
                                إن شركة تواصل شركة مستقلة ولن تشارك تواصل معلوماتك الشخصية مع أي جهة، باستثناء الحالات التي سنذكرها لاحقًا في هذه السياسة.<br />
                                تتلقى تواصل قدرًا محدودًا من المعلومات الشخصية منك -- وهي تحديدًا أرقام بطاقات الائتمان أو معلومات طرق الدفع الأخرى.
                            </p>
                            <h5 className='my-4'>كيفية مشاركة معلوماتك</h5>
                            <p>
                                لن تشارك تواصل معلوماتك الشخصية مع أي جهة لأغراض التسويق دون موافقة صريحة منك.<br />
                                لن نقوم ببيع معلوماتك الشخصية أو تأجيرها لأي جهة خارج تواصل ولن نمنح هذه المعلومات لأحد إلا إذا كان ذلك ضروريًا، أو إذا كان ذلك بموجب طلبات قانونية، كأن يكون ذلك استجابة لمذكرة إحضار أو تدقيق مستقل. ونطلب من أي جهة تتلقى هذه المعلومات أن تقصر استخدامها على هذه الأغراض.
                            </p>
                            <h5 className='my-4'>كيفية الوصول إلى معلوماتك الشخصية وتحديثها</h5>
                            <p>
                                يمكنك عرض معلوماتك الشخصية وتحديثها،. إذا قمت بتعطيل حسابك، فلن تتمكن من الوصول إلى معلوماتك الشخصية. نحتفظ ببعض هذه المعلومات بسجلاتنا فقط للوفاء بالتزاماتنا فيما يتعلق بالتقارير القانونية والتدقيق. لن تستخدم تواصل معلومات شخصية مقترنة بحسابات تم تعطيلها لأي غرض بخلاف الوفاء بهذه الالتزامات. يمكن أن نحذف سجلات تقترن بحسابات تم تعطيلها مع مرور الوقت حسبما تسمح به أو تنص عليه القوانين.
                            </p>
                            <h5 className='my-4'>كيفية الحفاظ على أمان معلوماتك الشخصية</h5>
                            <p>
                                نتخذ الإجراءات الأمنية اللازمة للحماية ضد الوصول غير المصرح به لمعلوماتك الشخصية أو تغييرها أو مشاركتها أو إتلافها. تشتمل تلك الإجراءات الأمنية على مراجعات داخلية لممارسات جمع البيانات وتخزينها ومعالجتها، وكذلك للإجراءات الأمنية، بالإضافة إلى الإجراءات الأمنية المادية والفنية للحماية من الوصول غير المصرح به لأنظمة تخزين البيانات الشخصية لدينا. تستخدم تواصل معايير تشفير رائدة لتشفير معلوماتك الشخصية. <br />
                                ويعتمد أمان حسابك أيضًا على الاحتفاظ بسرية كلمة السر الخاصة بك. ينبغي ألا تشارك اسم حسابك أو كلمة السر مع أي شخص. إذا أعطيت كلمة السر الخاصة بك لشخص آخر (مثل شخص عزيز عليك، أو رئيسك، أو موقع على الويب)، فسيحق له الوصول إلى حسابك وإلى معلوماتك الشخصية.
                            </p>
                            <h5 className='my-4'>ما الذي يحدث عندما تتغير هذه السياسة؟</h5>
                            <p>
                                قد تطرأ تغييرات على هذه السياسة من حين لآخر. لن نقلل من الحقوق التي تمنحك إياها هذه السياسة دون موافقة صريحة منك. سنقوم بنشر أي تغييرات تطرأ على هذه السياسة، وإذا كانت التغييرات كبيرة، فسنراسلك عبر البريد الإلكتروني أو نخطرك على حسابك. سيتم تعريف كل إصدار من إصدارات هذه السياسة أعلى الصفحة من خلال تاريخ سريانها. كما سنحتفظ بالإصدارات السابقة من سياسة الخصوصية هذه في الأرشيف حيث يمكنك قراءتها في أي وقت.
                            </p>
                            <h5 className='my-4'>إشعارات الخصوصية السنوية</h5>
                            <p>سترسل لك تواصل على الأقل مرة سنويًا إشعارًا حول الخصوصية ينص على:</p>
                            <ul className='d-flex flex-column gap-2'>
                                <li>أنواع المعلومات الشخصية التي نجمعها</li>
                                <li>كيفية وسبب معالجة المعلومات الشخصية</li>
                                <li>أنواع الأشخاص الذين قد يتلقون معلوماتك الشخصية</li>
                                <li>البلدان الأجنبية التي قد يتم نقل المعلومات الشخصية إليها، عندما يقتضي الأمر</li>
                                <li>حقيقة استخدام سبل حماية معقولة للخصوصية والأمان</li>
                                <li>الحقوق والخيارات المتوفرة للأشخاص فيما يتعلق بمعلوماتهم الشخصية</li>
                            </ul>
                            <p className='pt-4'>للاستفسارأكثر  بخصوص سياسة الخصوصية <a href='mailto: tawasulexperiment@gmail.com' target='_blank'>tawasulexperiment@gmail.com</a> </p>
                            <button className='btn btn-primary float-start mt-5' onClick={() => { navigate('/') }}>العودة للتسجيل</button>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    )
}