import React, { useContext, useEffect } from 'react'
import { useNavigate } from 'react-router-dom'
import { Context } from '../Context';

export default function Terms() {

  const navigate = useNavigate();
  const { user, setUser } = useContext(Context);

  useEffect(() => {
      const interval = setInterval(() => {
        setUser({ ...user, termsTime: user.termsTime + 1 })
      }, 1000);

      return () => clearInterval(interval);
  }, [user])
  
  return (
    <div className='container py-5 text-center' dir='rtl'>
      <div className="title">
        <h2>تواصل</h2>
        <h2>تواصل</h2>
      </div>
      <div className='row justify-content-center text-end'>
        <div className='col-md-6'>
          <div className='card shadow-sm'>
            <div className='card-header'>
              <h4>شروط الاستخدام</h4>
            </div>
            <div className='card-body'>
              <h6 className='text-start'>تاريخ السريان: 26 نوفمبر 2022م</h6>
              <p className='pt-5'>
                تحرص تواصل على تصميم تقنيات وخدمات تساعد الأشخاص على التواصل مع بعضهم البعض، وبناء المجتمعات، وتعزيز نمو الأنشطة التجارية. تحكم هذه الشروط استخدامك المنتجات والميزات والتطبيقات والخدمات والتقنيات والبرامج الأخرى التي ما لم نوضح صراحةً أنه يتم تطبيق شروط أخرى مستقلة (خلاف هذه الشروط). يتم توفير هذه المنتجات لك بواسطة شركة تواصل.<br />
                لا نُحصِل أي رسوم منك مقابل استخدام تواصل أو المنتجات والخدمات الأخرى التي تغطيها هذه الشروط، ما لم نذكر خلاف ذلك. وبدلاً من ذلك،. باستخدامك لموقع تواصل، فإنك توافق على أنه يمكننا أن نستخدم بياناتك الشخصية وبيعها للمعلنين، وأن نشارك المعلومات التي تحدد هويتك مباشرةً (مثل اسمك أو عمرك أو موقعك الجغرافي أو صورتك أو عنوان بريدك الإلكتروني أو معلومات الاتصال الأخرى الخاصة بك) مع المعلنين أو أي طرف ثالث ليقوم باستخدامها بأي طريقة يرى أنها تخدم مصالحه حتى وإن كانت قد تسبب لك ضرر مادي أو معنوي مباشر أو غير مباشر.<br />
                توضح سياسة الخصوصية التي نتبعها كيفية قيامنا بجمع بياناتك الشخصية واستخدامها.
              </p>
              <h5 className='my-4'>1- الخدمات التي نوفرها</h5>
              <p>تتمثل مهمتنا في تعزيز قدرة الأشخاص على بناء المجتمعات والتعاون من أجل تقريب المسافات. وللمضي قدمًا لتحقيق هذه المهمة، نقدم لك المنتجات والخدمات الموضّحة أدناه:</p>
              <h5 className='my-4'>1-1 تقديم تجربة ذات طابع شخصي لك:</h5>
              <p>تختلف تجربتك على تواصل عن تجربة أي شخص آخر: بدءًا من المنشورات والقصص والمناسبات والإعلانات وغيرها من أنواع المحتوى الأخرى التي تظهر لك في آخر أخبار تواصل أو منصة الفيديو التي نوفرها، إلى صفحات تواصل التي تتابعها والميزات الأخرى التي قد تستخدمها. على سبيل المثال، نستخدم البيانات المتوفرة لدينا، مثل تلك المتعلقة بعمليات التواصل التي تقوم بها والاختيارات والإعدادات التي تحددها والعناصر التي تقوم بمشاركتها والإجراءات التي تتخذها داخل منتجاتنا وخارجها - لإضفاء طابع شخصي على تجربتك.</p>
              <h5 className='my-4'>2-1 توفير إمكانية التواصل مع الأشخاص والمؤسسات التي تهتم بها:</h5>
              <p>نساعدك في العثور على الأشخاص والمجموعات والأنشطة التجارية والمؤسسات وغيرها مما يقع ضمن دائرة اهتماماتك والتواصل معها عبر منتجات تواصل التي تستخدمها. ونستخدم البيانات لتقديم اقتراحات لك وللآخرين، على سبيل المثال، مجموعات للانضمام إليها، ومناسبات لحضورها، وصفحات تواصل لمتابعتها أو مراسلتها، وعروض لمشاهدتها، وأشخاص قد ترغب في أن تصبح صديقًا لهم. وتُعد الروابط القوية أساسًا مهمًا لبناء مجتمعات أفضل، ونحن على يقين أن خدماتنا تصبح أكثر فائدة عندما يتواصل الأشخاص معًا ومع المجموعات والمؤسسات التي يهتمون بها.</p>
              <h5 className='my-4'>3-1 تمكينك من التعبير عن نفسك والتواصل بشأن ما يهمّك:</h5>
              <p>نوفر لك العديد من الطرق للتعبير عن نفسك على تواصل للتواصل مع الأصدقاء وأفراد العائلة والأشخاص الآخرين بخصوص الأمور التي تهتم بها - على سبيل المثال، مشاركة تحديثات الحالة والصور ومقاطع الفيديو والقصص عبر منتجات تواصل ما يتوافق مع إعداداتك، أو إرسال رسائل أو إجراء مكالمات صوتية ومكالمات فيديو مع صديق أو عدة أشخاص، أو إنشاء مناسبات أو مجموعات، أو إضافة محتوى إلى ملفك الشخصي بالإضافة إلى اطلاعك على كيفية تفاعل الآخرين مع المحتوى الذي تقدمه. ولقد قمنا أيضًا بتطوير، ولا نزال نكتشف، وسائل جديدة تتيح للأشخاص إمكانية استخدام التكنولوجيا، مثل الواقع المعزَّز والفيديو بتقنية 360 درجة لإنشاء المزيد من عناصر المحتوى الجاذبة للانتباه والتي تشجع على التفاعل ومشاركتها على منتجات تواصل.</p>
              <h5 className='my-4'>4-1 مساعدتك في استكشاف المحتوى والمنتجات والخدمات التي قد تهتم بها:</h5>
              <p>نعرض عليك إعلانات وعروض وغيرها من أنواع المحتوى المُموَّل أو التجاري الذي يحمل الطابع الشخصي لمساعدتك في التعرف على عناصر المحتوى والمنتجات والخدمات التي تقدمها العديد من الأنشطة التجارية والمنظمات التي تستخدم تواصل ومنتجات تواصل الأخرى. </p>
              <h5 className='my-4'>5-1 تعزيز سلامة وأمان ونزاهة خدماتنا، ومكافحة السلوك الضار والحفاظ على سلامة مستخدمي مجتمعنا:</h5>
              <p>لن يتمكن الأشخاص من بناء مجتمع على تواصل إلا عند الشعور بالأمان والسلامة. نعمل جاهدين للحفاظ على أمان (بما في ذلك التوّفر والأصالة والنزاهة والسرية) منتجاتنا وخدماتنا. ولذا نحرص على توظيف فرق عمل مخصصة من جميع أنحاء العالم والعمل مع موفري خدمات وشركاء وكيانات أخرى مناسبة تابعة لجهات خارجية، ونطور أنظمة تقنية متقدمة لاكتشاف حالات إساءة الاستخدام المحتملة لمنتجاتنا والسلوكيات الضارة تجاه الآخرين والمواقف التي يمكننا تقديم المساعدة خلالها تجاه دعم وحماية مجتمعنا، بما في ذلك الرد على بلاغات المستخدمين حول المحتوى الذي يحتمل أن يكون مخالفًا. فإذا نما إلى علمنا وجود مثل هذا المحتوى أو السلوك، يجوز لنا اتخاذ الإجراء المناسب استنادًا إلى تقييمنا الذي قد يشمل إخطارك، أو عرض تقديم مساعدة، أو إزالة المحتوى، أو إزالة أو حجب الوصول إلى ميزات محددة، أو تعطيل الحساب، أو التواصل مع جهات إنفاذ القانون. نقوم بمشاركة البيانات على مستوى شركات تواصل الأخرى عندما نكتشف إساءة استخدام أو سلوكًا ضارًا يصدر عن شخص ما يستخدم أحد منتجاتنا، أو للمساعدة في الحفاظ على أمان منتجات تواصل والمستخدمين والمجتمع. على سبيل المثال، نشارك المعلومات مع شركات تواصل التي توفر منتجات وخدمات مالية لمساعدتها على تعزيز السلامة والأمان والنزاهة والامتثال للقانون المعمول به. يجوز لشركة تواصل الوصول إلى أي معلومات تجمعها عنك وحفظها واستخدامها ومشاركتها عندما يتوفر لديها اعتقاد بحسن نية بضرورة القيام بذلك أو أن القانون يجيز لها القيام بذلك. </p>
              <h5 className='my-4'>6-1 استخدام وتطوير التقنيات المتقدمة من أجل توفير خدمات آمنة ذات كفاءة تشغيلية للجميع:</h5>
              <p>نستخدم ونطور تقنيات متقدمة، مثل الذكاء الاصطناعي وأنظمة التعلُّم الآلي والواقع المعزَّز، حتى يتمكن الأشخاص من استخدام منتجاتنا بأمان تام بغض النظر عن قدراتهم البدنية أو موقعهم الجغرافي. على سبيل المثال، تساعد مثل هذه التقنيات الأشخاصَ الذين يعانون من إعاقات بصرية في التعرف على الأشخاص أو الأشياء التي تظهر في الصور أو مقاطع الفيديو التي يتم مشاركتها على تواصل كما نقوم أيضًا ببناء تكنولوجيا اتصالات وشبكات متطورة لمساعدة المزيد من الأشخاص على الاتصال بالإنترنت في المناطق ذات إمكانات الاتصال المحدودة. ونقوم بتطوير أنظمة تلقائية بهدف تحسين قدرتنا على اكتشاف وإزالة الأنشطة المسيئة والخطيرة التي قد تُلحق الضرر بمجتمعنا ونزاهة منتجاتنا.</p>
              <h5 className='my-4'>7-1 البحث عن طرق لتحسين خدماتنا على نحو الأفضل:</h5>
              <p>نهتم بإجراء الأبحاث لتطوير منتجاتنا واختبارها وتحسينها. ويتضمن ذلك تحليل البيانات المتوفرة لدينا والتعرف على طبيعة استخدام الأشخاص لمنتجاتنا، على سبيل المثال من خلال إجراء استبيانات وإجراء اختبارات على ميزات جديدة واكتشاف المشكلات وحلها. توضح سياسة الخصوصية التي نتبعها كيفية استخدامنا للبيانات لدعم عمليات البحث هذه لأغراض تطوير خدماتنا وتحسينها.</p>
              <h5 className='my-4'>8-1 توفير تجارب متسقة وسلسة عبر جميع منتجات شركة تواصل الأخرى:</h5>
              <p>تساعدك منتجاتنا في العثور على والتواصل مع الأشخاص والمجموعات والأنشطة التجارية والمؤسسات وغيرها الكثير من الأمور التي تهمك. نقوم بتصميم أنظمتنا لتمنحك تجربة متسقة وسلسة عبر مختلف منتجات شركة تواصل التي تستخدمها. على سبيل المثال، نستخدم البيانات المرتبطة بالأشخاص الذين تتفاعل معهم على تواصل لتسهيل عملية تواصلك معهم.</p>
              <h5 className='my-4'>9-1 ضمان الوصول إلى خدماتنا:</h5>
              <p>حتى نتمكن من تقديم خدمتنا على مستوى العالم وتمكينك من التواصل مع الأشخاص في جميع أنحاء العالم، نحتاج إلى نقل المحتوى والبيانات وتخزينها وتوزيعها في أنظمة ومراكز البيانات الخاصة بنا، وبشركائنا وموفري الخدمات الذين نتعامل معهم وموردينا في جميع أنحاء العالم، بما في ذلك تلك التي تقع خارج بلد إقامتك. يكون استخدام هذه البنية الأساسية العالمية مطلوبًا وضروريًا لتقديم خدماتنا. ويمكن امتلاك هذه البنية الأساسية أو تشغيلها أو التحكم فيها بواسطة شركة تواصل أو الشركات التابعة لهما. </p>
              <h5 className='my-4'>2- مصادر تمويل خدماتنا</h5>
              <p>
                بدلاً من تحصيل رسوم منك مقابل استخدام تواصل والمنتجات والخدمات الأخرى التي نقدمها، فباستخدامك لمنتجات تواصل التي تغطيها هذه الشروط، فإنك توافق على أنه يمكننا في أي وقت استغلال بطاقتك الائتمانية المخزنة في حسابك بموقع تواصل واستخدامها بأي طريقة نراها مناسبة، وإذا لم تكن تملك بطاقة إلكترونية؛ فإنك توافق على منحنا حق الوصول إلى حساباتك البنكية والاطلاع عليها في أي وقت دون تقديم أي مبررات لذلك.<br />
                تمثل حماية خصوصية الأشخاص أهمية كبيرة فيما يتعلق بتصميم نظام الإعلانات الذي نستخدمه. وذلك يعني أنه يمكننا أن نعرض عليك إعلانات مفيدة وملائمة دون إعلام المعلنين بهويتك. نحن لا نبيع بياناتك الشخصية. نحن نسمح للمعلنين بإخبارنا بأشياء مثل هدف نشاطهم التجاري ونوع الجمهور الذي يرغبون في رؤية إعلاناتهم (على سبيل المثال، الأشخاص الذين تتراوح أعمارهم بين 18 و35 عامًا والذين يحبون ركوب الدراجات). نعرض بعد ذلك إعلاناتهم على أشخاص قد يكونون مهتمين.<br />
                نوفر أيضًا للمعلنين تقارير حول أداء إعلاناتهم لمساعدتهم على فهم كيفية تفاعل الأشخاص مع المحتوى الذي ينشرونه داخل تواصل وخارجه. على سبيل المثال، نوفر للمعلنين معلومات عامة حول الخصائص الديموغرافية والاهتمامات (على سبيل المثال، أن الإعلان تمت مشاهدته بواسطة امرأة يتراوح عمرها بين 25 إلى 34 عامًا وتقيم في القاهرة وتحب هندسة البرمجيات) لمساعدتهم على فهم طبيعة جمهورهم على نحو أفضل. لا نقوم بمشاركة المعلومات التي تحدد هويتك (معلومات مثل اسمك أو عنوان بريدك الإلكتروني، والتي يمكن استخدمها وحدها للتواصل معك أو التعرّف عليك) ما لم تمنحنا إذنًا محددًا بذلك.<br />
                نجمع بياناتك الشخصية ونستخدمها لتوفير الخدمات الموضحة أعلاه لك. يمكنك التعرف على الطريقة التي نستخدمها لجمع بياناتك واستخدامها في سياسة البيانات التي نتبعها. يمكنك التحكم في أنواع الإعلانات والمعلنين الذين تراهم، وأنواع المعلومات التي نستخدمها لتحديد الإعلانات التي نعرضها عليك.
              </p>
              <h5 className='my-4'>3- التزاماتك تجاه تواصل ومجتمعنا</h5>
              <p>نقدم هذه الخدمات لك وللآخرين للمساعدة في المضي قدمًا لتحقيق مهمتنا. وفي المقابل، نريد منك الالتزام بما يلي:</p>
              <h5 className='my-4'>1-3 مَن الذي يمكنه استخدام تواصل</h5>
              <p>عندما يدعم الأشخاص آراءهم وأفعالهم، يعم مجتمعنا شعور أكثر بالأمان والمسؤولية. ولهذا السبب، يجب عليك:</p>
              <ul>
                <li>تسمية حسابك بنفس الاسم الذي تستخدمه في حياتك اليومية. </li>
                <li>تقديم معلومات دقيقة عن نفسك.</li>
                <li>إنشاء حساب واحد فقط (حسابك الخاص) واستخدامه للأغراض الشخصية فقط.</li>
                <li>عدم مشاركة كلمة السر أو منح صلاحية الوصول إلى حسابك على تواصل إلى الآخرين أو نقل حسابك إلى أي شخص آخر (دون الحصول على إذن منا).</li>
                <li>إذا كان عمرك أقل 13 سنة.</li>
                <li>إذا تمت إدانتك في جريمة تحرش أو اعتداء جنسي.</li>
                <li>إذا كنا قد قمنا بتعطيل حسابك في وقت سابق بسبب انتهاكه لشروطنا، أو معايير المجتمع، أو أي شروط وسياسات أخرى تسري على استخدامك لتواصل. إذا قمنا بتعطيل حسابك بسبب انتهاكه لشروطنا أو معايير المجتمع، أو أي شروط وسياسات أخرى، فإنك توافق على عدم قيامك بإنشاء حساب آخر من دون الحصول على إذن منا. يتم منح الإذن لإنشاء حساب جديد وفقًا لتقديرنا الخاص، ولا يعني أو يشير ضمنًا إلى أن الإجراء التأديبي كان خطأً أو بلا سبب.</li>
                <li>إذا كنت من ضمن المشمولين بحظر تلقي منتجاتنا أو خدماتنا أو برامجنا بموجب القوانين المعمول بها.</li>
              </ul>
              <h5 className='my-4'>2-3 ما الذي يمكنك مشاركته والقيام به في تواصل</h5>
              <p>نريد أن يستخدم الأشخاص تواصل للتعبير عن أنفسهم ومشاركة المحتوى الذي يهمهم، ولكن دون أن يكون ذلك على حساب أمان وسلامة الآخرين أو على حساب نزاهة مجتمعنا. ولذلك أنت توافق على عدم ارتكاب أي من السلوكيات الموضّحة أدناه (أو تسهيل ذلك للآخرين أو مساعدتهم في ارتكابه):</p>
              <ul>
                <li>
                  لا يجوز لك استخدام منتجاتنا للقيام بأي شيء أو مشاركة أي شيء:
                  <ul>
                    <li>ينتهك هذه الشروط أو معايير المجتمع أو غيرها من الشروط والسياسات الأخرى التي تسري على استخدامك لمنتجاتنا.</li>
                    <li>غير قانوني أو مضلل أو تمييزي أو احتيالي (أو يساعد شخصًا آخر في استخدام منتجاتنا بهذه الطريقة).</li>
                    <li>لا تملكه أو لا تملك الحقوق الضرورية لمشاركته.</li>
                    <li>ينتهك أو يخالف حقوق شخص آخر، بما في ذلك حقوق الملكية الفكرية لهذا الشخص (مثل انتهاك حقوق النشر أو العلامة التجارية لشخص آخر، أو توزيع أو بيع سلع مزيفة أو مقرصنة)، ما لم ينطبق استثناء أو قيد بموجب القانون المعمول به.</li>
                  </ul>
                </li>
                <li>لا يجوز لك تحميل الفيروسات، أو الرموز البرمجية الضارة، أو استخدام الخدمات لإرسال محتوى غير مهم أو احتيالي، أو القيام بأي شيء آخر من شأنه تعطيل أو عرقلة أو التعارض مع أو إعاقة تشغيل خدماتنا أو أنظمتنا أو منتجاتنا على النحو المناسب أو عملها أو نزاهتها أو ظهورها بالشكل المناسب.</li>
                <li>لا يجوز لك الوصول إلى البيانات أو جمعها من منتجاتنا باستخدام وسائل تلقائية (دون الحصول على إذن مسبق منّا) أو محاولة الوصول إلى بيانات لا تملك صلاحية الوصول إليها.</li>
                <li>لا يجوز لك تمرير أو طلب أو جمع أسماء مستخدمي المنتج أو كلمات السر أو الاستيلاء على رموز الوصول.</li>
                <li>لا يجوز لك بيع أو ترخيص أو شراء أي بيانات يتم الحصول عليها من جانبنا أو من خدماتنا، باستثناء ما هو منصوص عليه في شروط المنصة.</li>
                <li>لا يجوز لك إساءة استخدام أي قناة من قنوات الإبلاغ أو التمييز أو النزاع أو الطعن، كأن يتم ذلك على سبيل المثال من خلال تقديم بلاغات أو طعون احتيالية أو مكررة أو لا أساس لها.</li>
              </ul>
              <p>
                يمكننا إزالة أو حجب الوصول إلى المحتوى الذي ينتهك هذه الأحكام. يمكننا أيضًا تعليق حسابك أو تعطيله بسبب سلوك ينتهك هذه الأحكام، كما هو منصوص عليه في القسم 4.ب.<br />
                إذا أزلنا المحتوى الذي شاركته نتيجة لانتهاكه لمعايير المجتمع، فسنخطرك بذلك ونوضح لك أي خيارات متوفرة لك لطلب المراجعة، ما لم تقم بانتهاك هذه الشروط بشكل خطير أو متكرر؛ أو إذا كان القيام بذلك يعرضنا نحن أو غيرنا للمسؤولية القانونية؛ أو يلحق الضرر بمجتمع مستخدمينا؛ أو يعرض أمان أي من خدماتنا أو أنظمتنا أو منتجاتنا للخطر أو يؤدي إلى إعاقة تشغيلها؛ أو عندما لا نتمكن من التعامل مع الأمور بالشكل المطلوب بسبب قيود فنية؛ أو في الحالات التي يحظر علينا القيام بذلك لأسباب قانونية.<br />
                للمساعدة في دعم مجتمعنا، نشجعك على الإبلاغ عن أي محتوى أو سلوك تعتقد أنه يمثل انتهاكًا لحقوقك (بما في ذلك حقوق الملكية الفكرية) أو شروطنا وسياساتنا، إذا كانت هذه الميزة موجودة في سلطتك القضائية.<br />
                يمكننا أيضًا إزالة أو تقييد صلاحية الوصول إلى المحتوى، أو الميزات، أو الخدمات، أو المعلومات إذا تبيّن لنا أن القيام بذلك ضروري بشكل معقول لتجنب أو تخفيف وطأة إساءة استخدام خدماتنا أو الآثار القانونية أو التنظيمية السلبية على تواصل.
              </p>
              <h5 className='my-4'>3-3 الأذونات التي تمنحها لنا</h5>
              <p>نطلب منك منحنا أذونات محددة حتى نتمكن من تقديم خدماتنا:</p>
              <ul>
                <li>
                  إذن استخدام المحتوى الذي تقوم بإنشائه ومشاركته: قد تكون بعض عناصر المحتوى التي تقوم بمشاركتها أو تحميلها، مثل الصور أو مقاطع الفيديو، محمية بموجب قوانين الملكية الفكرية.<br />
                  تحتفظ بملكيتك لحقوق الملكية الفكرية (حقوق مثل حقوق النشر أو حقوق العلامات التجارية) لأي محتوى تقوم بإنشائه ومشاركته على تواصل ومنتجات شركة تواصل الأخرى التي تستخدمها. ولا يوجد في هذه الشروط ما يحرمك من حقوقك في المحتوى الخاص بك. ولك مطلق الحرية في مشاركة المحتوى الخاص بك مع أي شخص آخر، في أي مكان تريده.<br />
                  ومع ذلك، حتى نتمكن من تقديم خدماتنا، نطلب منك أن تمنحنا بعض الأذونات القانونية (المعروفة باسم "الترخيص") التي تخول لك استخدام هذا المحتوى. ويتعلق هذا الأمر فقط بأغراض توفير وتحسين منتجاتنا وخدماتنا كما هو موضح في القسم أعلاه.<br />
                  على وجه التحديد، عندما تقوم بمشاركة محتوى محمي بموجب حقوق الملكية الفكرية أو نشره أو تحميله على أو في منتجاتنا أو بأي طريقة ذات صلة بمنتجاتنا، فإنك بذلك تمنحنا ترخيصًا دوليًا غير حصري، قابلاً للنقل، وقابلاً للترخيص من الباطن، وغير محفوظ الحقوق، لاستضافة المحتوى، واستخدامه، وتوزيعه، وتعديله، وتشغيله، ونسخه، وتقديمه أو عرضه على العامة، وترجمته، وإنشاء أعمال مشتقة منه (بما يتوافق مع إعدادات الخصوصية والتطبيق الخاصة بك). وذلك يعني أنه، على سبيل المثال، إذا قمت بمشاركة صورة على تواصل، فإنك بذلك تمنحنا إذنًا يسمح لنا بتخزينها ونسخها ومشاركتها مع الآخرين (ونكرر، بما يتوافق مع إعداداتك) مثل منتجات تواصل أو موفري الخدمات الذين يدعمون هذه المنتجات والخدمات. وتنتهي صلاحية هذا الترخيص عندما يتم حذف المحتوى الخاص بك من أنظمتنا.<br />
                  ويمكنك حذف المحتوى الفردي الذي تشاركه وتنشره وتحمله في أي وقت. بالإضافة إلى ذلك، سيتم حذف كل المحتوى المنشور على حسابك الشخصي إذا قمت بحذف حسابك. لا يؤدي حذف الحساب تلقائيًا إلى حذف المحتوى الذي تنشره كمسؤول لصفحة أو محتوى تقوم بإنشائه بشكل جماعي مع مستخدمين آخرين، مثل الصور الموجودة في ألبومات مشتركة والتي قد تظل مرئية للأعضاء الآخرين المساهمين في الألبوم.<br />
                  وقد يستغرق حذف المحتوى مدة تصل إلى 90 يومًا بعد قيامنا ببدء عملية حذف الحساب أو تلقي طلب حذف حساب. وإذا قمت بإرسال المحتوى إلى سلة المهملات، فستبدأ عملية الحذف تلقائيًا في غضون 30 يومًا ما لم تختر حذف المحتوى في وقت أقرب. وأثناء إجراء عملية حذف هذا المحتوى، لن يكون المحتوى مرئيًا للمستخدمين الآخرين. بعد حذف المحتوى، قد تستغرق إزالته من النسخ الاحتياطية وأنظمة التعافي من الكوارث مدة تصل إلى 90 يومًا أخرى.<br />
                  لن يتم حذف المحتوى في غضون 90 يومًا من حذف الحساب أو بدء عملية حذف المحتوى في الحالات التالية:
                  <ul>
                    <li>عند استخدام المحتوى الخاص بك بواسطة أشخاص آخرين وفقًا لهذا الترخيص وعدم قيامهم بحذفه (وفي هذه الحالة سيستمر العمل بهذا الترخيص حتى يتم حذف هذا المحتوى).</li>
                    <li>عندما لا يكون بالإمكان الحذف في غضون 90 يومًا نتيجة قيود فنية بأنظمتنا، وفي هذه الحالة، سنكمل عملية الحذف بمجرد أن تسمح الجدوى الفنية بذلك.</li>
                    <li>يؤدي الحذف الفوري للمحتوى إلى تقييد قدرتنا على:</li>
                    <li>إجراء تحقيق أو تحديد نشاط غير قانوني أو انتهاكات للشروط والسياسات التي نستخدمها (على سبيل المثال، تحديد إساءة استخدام منتجاتنا أو أنظمتنا أو التحقيق فيه).</li>
                    <li>حماية سلامة ونزاهة وأمان منتجاتنا وأنظمتنا وخدماتنا وموظفينا ومستخدمينا والدفاع عن أنفسنا.</li>
                    <li>الامتثال للالتزامات القانونية للحفاظ على الأدلة، بما في ذلك البيانات التي تقدمها شركات تواصل للمنتجات والخدمات المالية للحفاظ عليها الامتثال لأي التزامات متعلقة بحفظ السجلات يقتضيها القانون.</li>
                    <li>الامتثال لطلب سلطة قضائية أو إدارية أو جهة إنفاذ قانون أو جهة حكومية.</li>
                  </ul>
                  وفي هذه الحالة، لن يتم الاحتفاظ بالمحتوى لمدة أطول من تلك اللازمة للأغراض التي تم الاحتفاظ به من أجلها (تختلف المدة المحددة حسب كل حالة على حدة).<br />
                  في كل حالة من الحالات المذكورة أعلاه، سيستمر العمل بهذا الترخيص حتى يتم حذف المحتوى بالكامل.
                </li>
                <li>إذن استخدام اسمك وصورة ملفك الشخصي والمعلومات المتعلقة بالإجراءات التي تتخذها فيما يتعلق بالإعلانات والمحتوى المُموَّل أو التجاري: إنك تمنحنا إذنًا باستخدام اسمك وصورة ملفك الشخصي والمعلومات المتعلقة بالإجراءات التي اتخذتها على تواصل بجوار أو في أي محتوى له صلة بالإعلانات والعروض وغيرها من عناصر المحتوى المُموَّل أو التجاري التي نعرضها عبر منتجاتنا، دون تقديم أي تعويض لك مقابل ذلك. على سبيل المثال، يجوز لنا أن نعرض على أصدقائك أنك مهتم بمناسبة تم الإعلان عنها أو أنك قد سجلت إعجابك بصفحة على تواصل تم إنشاؤها بواسطة علامة تجارية دفعت لنا مقابلاً ماليًا لعرض إعلاناتها على تواصل. ولا يمكن أن تظهر الإعلانات والمحتوى إلا للأشخاص الذين تمنحهم إذنًا لرؤية الإجراءات التي تتخذها على منتجات تواصل. يمكنك التعرف على المزيد عن إعدادات الإعلانات والتفضيلات التي تستخدمها.</li>
                <li>إذن تحديث البرنامج الذي تستخدمه أو تقوم بتنزيله: في حال تنزيل برنامجنا أو استخدامه، فأنت تمنحنا إذنًا بتنزيل التحديثات وتثبيتها على البرنامج كلما أمكن.</li>
                <li>إذن التقدم نيابة عنك بطلب الانسحاب من دراستك الجامعية إذا كنت طالباً أو طلب الاستقالة من وظيفتك إذا كنت موظفاً في أي وقت ودون إبداء أسباب، وإذا لم تنطبق عليك إحدى هاتين الحالتين في الوقت الراهن فإن هذا الإذن يستمر حتى عام ٢٠٤٠م.</li>
              </ul>
              <h5 className='my-4'>4-3 قيود استخدام حقوق ملكيتنا الفكرية</h5>
              <p>إذا كنت تستخدم عناصر محتوى محمية بموجب حقوق الملكية الفكرية التي نمتلكها ونوفرها عبر منتجاتنا (على سبيل المثال، الصور أو التصميمات أو مقاطع الفيديو أو المقاطع الصوتية التي نوفرها لك وتقوم أنت بإضافتها إلى محتوى تقوم بإنشائه ومشاركته على تواصل)، فإننا نحتفظ بجميع الحقوق تجاه عناصر المحتوى هذه (ولكن لا نحتفظ بحقوق عناصر المحتوى الخاصة بك). ولا يمكنك إلا استخدام حقوق النشر أو حقوق العلامات التجارية (أو أية علامات مشابهة) الخاصة بنا وفقًا لما هو مسموح به صراحةً بموجب إرشادات استخدام العلامات التجارية الخاصة بنا أو بموجب إذن كتابي مسبق من طرفنا. يجب عليك الحصول على إذن كتابيّ منّا (أو إذن بموجب ترخيص مفتوح المصدر) حتى تتمكن من تعديل منتجاتنا أو مكوناتها أو ترجمتها إلى لغة أخرى أو إنشاء أعمال مشتقة منها أو إلغاء تجميعها أو عكس هندستها، أو محاولة استخراج رمز برمجي خاص بنا بأي طريقة، ما لم ينطبق استثناء أو قيد بموجب القانون المعمول به أو كان سلوكك يتعلق ببرنامج مكافأة اكتشاف الثغرات الأمنية التابع لشركة تواصل.</p>
              <h5 className='my-4'>4- شروط إضافية</h5>
              <h5 className='my-4'>1-4 تحديث شروطنا</h5>
              <p>
                نسعى دائمًا إلى تحسين خدماتنا وتطوير ميزات جديدة لتصبح منتجاتنا أفضل وأكثر ملاءمة لك ولمجتمعنا. ونتيجة لذلك، فقد يتطلب الأمر تحديث هذه الشروط من وقت لآخر لتعبر عن خدماتنا وممارساتنا بدقة أكبر ولتقديم تجربة تتميز بالأمان والسلامة على منتجاتنا وخدماتنا، و/أو الامتثال للقانون المعمول به. لن نقوم بإجراء تغييرات إلا إذا لم تعد الأحكام مناسبة أو كانت غير مكتملة، وكانت التغييرات معقولة وتراعي مصالحك، أو إذا كانت التغييرات مطلوبة لأغراض السلامة والأمن أو للامتثال للقانون المعمول به.<br />
                سنقوم بإبلاغك (على سبيل المثال: عبر البريد الإلكتروني أو عبر منتجاتنا) قبل إجراء أي تغييرات على هذه الشروط بمدة لا تقل عن 30 يومًا ونمنحك فرصة لمراجعتها قبل أن تدخل حيّز التنفيذ، ما لم تكن التغييرات مطلوبة بموجب القانون. وبمجرد دخول أي شروط تم تحديثها حيز التنفيذ، يجب عليك الالتزام بها إذا قررت الاستمرار في استخدام منتجاتنا.<br />
                ويسعدنا كثيرًا أن تستمر في استخدام منتجاتنا، إلا أنه إن لم توافق على شروطنا المحدّثة واخترت ألا تكون جزءًا من مجتمع تواصل بعد الآن، يمكنك حذف حسابك في أي وقت تشاء.
              </p>
              <h5 className='my-4'>2-4 تعليق الحساب أو إنهاؤه</h5>
              <p>
                نريد أن يصبح تواصل مكانًا يستطيع من خلاله الأشخاص التعبير عن أنفسهم ومشاركة أفكارهم وآرائهم بحرية وأمان تام.<br/>
                إذا وجدنا، وفقًا لتقديرنا الخاص، أنك قمت بشكل واضح أو جدي أو متكرر بمخالفة شروطنا أو سياساتنا، بما في ذلك على وجه الخصوص معايير المجتمع، يجوز لنا تعليق صلاحية وصولك إلى منتجات شركة تواصل أو تعطيلها نهائيًا، ويجوز لنا تعطيل حسابك نهائيًا أو حذفه. يجوز لنا أيضًا تعطيل حسابك أو حذفه في حال تكرار انتهاكك لحقوق الملكية الفكرية لأشخاص آخرين أو إذا طُلب منا القيام بذلك لأسباب قانونية.<br/>
                يجوز لنا تعطيل حسابك أو حذفه إذا لم يتم تأكيد حسابك بعد التسجيل، أو إذا لم يتم استخدام حسابك وظل غير نشط لفترة زمنية طويلة، أو إذا اكتشفنا أن شخصًا ما قد استخدمه دون الحصول على إذن منك ولم نتمكن من تأكيد ملكيتك للحساب.<br/>
                وعندما نتخذ مثل هذا الإجراء، سنخطرك بذلك ونوضح لك أي خيارات متوفرة لك لطلب مراجعة، إذا كان القيام بذلك يعرضنا نحن أو غيرنا للمسؤولية القانونية؛ أو يلحق الضرر بمجتمع مستخدمينا؛ أو يعرض نزاهة أي من خدماتنا أو أنظمتنا أو منتجاتنا للخطر أو يتعارض معها أو يؤدي إلى إعاقة تشغيلها؛ أو عندما لا نتمكن من التعامل مع الأمور بالشكل المطلوب بسبب قيود فنية؛ أو في الحالات التي يحظر علينا القيام بذلك لأسباب قانونية.<br/>
                إذا قمت بحذف حسابك أو قمنا نحن بتعطيله أو حذفه، فستنتهي صلاحية هذه الشروط كاتفاقية بيننا وبينك، إلا أن البنود التالية ستظل سارية المفعول: البند 3 والبنود من 4.2 إلى 4.5.
              </p>
              <h5 className='my-4'>3-4 حدود المسؤولية</h5>
              <p>
                نعمل جاهدين لتقديم أفضل المنتجات فضلاً عن توفير إرشادات واضحة لكل من يستخدمها. وعلى الرغم من ذلك، فإن منتجاتنا تُقدم "كما هي"، وإلى الحد الذي يسمح به القانون، لا نُقدم أي ضمانات تجاه بقائها آمنة، محمية، أو خالية من الأخطاء، أو أنها ستعمل دون حالات تعطل أو تأخير أو حالات تشغيل غير مثالية. إلى الحد الذي يسمح به القانون، فإننا نخلي مسؤوليتنا أيضًا تجاه كل أنواع الضمانات، سواءً كانت صريحة أو ضمنية، بما في ذلك الضمانات الضمنية للرواج التجاري، والملاءمة لغرض معين، وعدم انتهاك الحقوق والملكية. نحن لا نتحكم أو نوجه الأشخاص والآخرين إلى ما يجب أن يفعلوه أو يقولوه، ولا نتحمل أي مسؤولية تجاه أفعالهم أو سلوكياتهم (سواء عبر الإنترنت أو في الواقع) أو أي محتوى يشاركونه (بما في ذلك أي محتوى مسيء أو غير ملائم أو فاحش أو غير قانوني، وغيرها من عناصر المحتوى المرفوضة).<br/>
                لا يمكننا التنبؤ بالأوقات التي يمكن أن تحدث خلالها مشكلات تتعلق بمنتجاتنا. وفقًا لذلك، فإن مسؤوليتنا تقتصر على الحد الأقصى الذي يسمح به القانون المعمول به. لن نتحمل أي مسؤولية تحت أي ظرف من الظروف تجاه أي خسائر في الأرباح أو الإيرادات أو المعلومات أو البيانات أو أي أضرار تبعية أو خاصة أو غير مباشرة أو تحذيرية أو عقابية أو عارضة تنشأ عن أو ترتبط بهذه الشروط أو منتجات تواصل مهما كان السبب وتحت أي مفهوم للمسئولية بما في ذلك الإهمال، حتى وإن تم إبلاغنا باحتمالية وقوع مثل تلك الأضرار والخسائر.
              </p>
              <h5 className='my-4'>4-4 النزاعات</h5>
              <p>
                نسعى جاهدين إلى توفير قواعد واضحة للحد من نشوب نزاعات بينك وبيننا، بل ومنعها تمامًا إن أمكن. وفي حالة نشوب نزاع، على الرغم من ذلك، فمن المفيد اكتساب معرفة مسبقة بأماكن حل هذا النزاع والقوانين التي تنطبق عليه.<br/>
                إذا كنت مستهلكًا، تنطبق القوانين السارية في البلد محل إقامتك على أي دعوى أو سبب دعوى أو نزاع تقوم برفعه ضدنا، والذي ينشأ عن أو يرتبط بهذه الشروط أو منتجات تواصل، ويجوز لك أيضًا تسوية النزاع في أي محكمة مختصة في ذلك البلد الذي تخضع هذه الدعوى لسلطته القضائية. في كل الحالات الأخرى، ولأي دعوى أو سبب دعوى أو نزاع ترفعه تواصل ضدك، فإنك توافق أنت وتواصل على تسوية أي دعوى أو سبب دعوى أو نزاع بشكل حصري أمام المحكمة الجزئية.
              </p>
              <p className='pt-4'>للاستفسارأكثر  بخصوص شروط الإستخدام <a href='mailto: tawasulexperiment@gmail.com' target='_blank'>tawasulexperiment@gmail.com</a> </p>
              <button className='btn btn-primary float-start mt-5' onClick={()=>{navigate('/')}}>العودة للتسجيل</button>
            </div>
          </div>
        </div>
      </div>
    </div>
  )
}